Catalogs/ДанныеДляПечатиМашрутныхЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДанныеДляПечатиМашрутныхЛистов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принтер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автотранспорт</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДанныеДляПечатиМашрутныхЛистов/Ext/ManagerModule.bsl
Функция ПолучитьДанныеДляПечати(Маршрут, Склад, Организация)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляПечатиМашрутныхЛистов.Ссылка КАК Ссылка,
		|	ДанныеДляПечатиМашрутныхЛистов.Наименование КАК Наименование,
		|	ДанныеДляПечатиМашрутныхЛистов.Маршрут КАК Маршрут,
		|	ДанныеДляПечатиМашрутныхЛистов.Принтер КАК Принтер,
		|	ДанныеДляПечатиМашрутныхЛистов.Склад КАК Склад,
		|	ДанныеДляПечатиМашрутныхЛистов.Автомобиль КАК Автомобиль,
		|	ДанныеДляПечатиМашрутныхЛистов.Водитель КАК Водитель,
		|	ДанныеДляПечатиМашрутныхЛистов.Перевозчик КАК Перевозчик,
		|	ДанныеДляПечатиМашрутныхЛистов.Организация КАК Организация,
		|	ДанныеДляПечатиМашрутныхЛистов.Экспедитор КАК Экспедитор,
		|	ДанныеДляПечатиМашрутныхЛистов.Пользователи.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Пользователь КАК Пользователь
		|	) КАК Пользователи
		|ИЗ
		|	Справочник.ДанныеДляПечатиМашрутныхЛистов КАК ДанныеДляПечатиМашрутныхЛистов
		|ГДЕ
		|	ДанныеДляПечатиМашрутныхЛистов.Маршрут = &Маршрут
		|	И ДанныеДляПечатиМашрутныхЛистов.Склад = &Склад
		|	И ДанныеДляПечатиМашрутныхЛистов.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Маршрут", Маршрут);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции
